The Site Surface failed to triangulate.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SurfaceTriangulationFailed { get; }
  Visual Basic
Public Shared ReadOnly Property SurfaceTriangulationFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SurfaceTriangulationFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace